Процедура ЗаполнитьЗаголовки(Запрос, Ответ)
	//Обходим CORS
	Origin = Запрос.Заголовки.Получить("Origin");
	Если Origin = Неопределено Тогда
		Ответ.Заголовки.Вставить("Access-Control-Allow-Origin", "*");
	Иначе
		Ответ.Заголовки.Вставить("Access-Control-Allow-Origin", Origin);
	КонецЕсли;	
	Ответ.Заголовки.Вставить("Access-Control-Allow-Headers", "Authorization,Content-type");
	Ответ.Заголовки.Вставить("Access-Control-Allow-Methods", "GET, POST, PUT");	
	//Ответ.Заголовки.Вставить("Content-Type", "text/html; charset=windows-1251");
	Ответ.Заголовки.Вставить("Content-Type", "text/html; charset=utf-8");

КонецПроцедуры

Функция basesgetlist(Запрос)
	СписокБаз = Новый ЗаписьJSON;
	СписокБаз.УстановитьСтроку();
	ЗаписатьJSON(СписокБаз, РаботаСХранилищами.ВернутьСписокБаз());
	Ответ = Новый HTTPСервисОтвет(200);
	ЗаполнитьЗаголовки(Запрос, Ответ);
	Ответ.УстановитьТелоИзСтроки(СписокБаз.Закрыть(),КодировкаТекста.UTF8); 
	Возврат Ответ;
КонецФункции

Функция metagetlist(Запрос)
	СписокБаз = Новый ЗаписьJSON;
	СписокБаз.УстановитьСтроку();
	ЗаписатьJSON(СписокБаз, РаботаСХранилищами.ВернутьСписокМетаданных(Запрос.ПараметрыURL["idbase"],Запрос.ПараметрыURL["idtype"]));
	Ответ = Новый HTTPСервисОтвет(200);
	ЗаполнитьЗаголовки(Запрос, Ответ);
	Ответ.УстановитьТелоИзСтроки(СписокБаз.Закрыть(),КодировкаТекста.UTF8); 
	Возврат Ответ;
КонецФункции

Функция changesgetlist(Запрос)
	СписокБаз = Новый ЗаписьJSON;
	СписокБаз.УстановитьСтроку();
	ЗаписатьJSON(СписокБаз, РаботаСХранилищами.ВернутьИсторию(Запрос.ПараметрыURL["idbase"],Запрос.ПараметрыURL["idmeta"]));
	Ответ = Новый HTTPСервисОтвет(200);
	ЗаполнитьЗаголовки(Запрос, Ответ);
	Ответ.УстановитьТелоИзСтроки(СписокБаз.Закрыть(),КодировкаТекста.UTF8); 
	Возврат Ответ
КонецФункции

Функция repchangesgetlist(Запрос)
	ИзмененияЗаПериод = Новый ЗаписьJSON;
	ИзмененияЗаПериод.УстановитьСтроку();
	Попытка
		firstdata = Дата(Запрос.ПараметрыURL["firstdata"]);  
		Seconddata = Дата(Запрос.ПараметрыURL["seconddata"]);
		ЗаписатьJSON(ИзмененияЗаПериод, РаботаСХранилищами.ВернутьИсториюЗаПериод(Запрос.ПараметрыURL["idbase"],firstdata,seconddata));
	Исключение
	Конецпопытки;
	Ответ = Новый HTTPСервисОтвет(200);
	ЗаполнитьЗаголовки(Запрос, Ответ);
	Ответ.УстановитьТелоИзСтроки(ИзмененияЗаПериод.Закрыть(),КодировкаТекста.UTF8); 
	Возврат Ответ
КонецФункции
